Lehrstuhl Datenbanken und Informationssysteme - DBIS <span style="float:right"> SoSe 2024
</span> <br>
Kate Revoredo, Steven Purtzel, Maike Basmer <span style="float:right"> Aufgabenblatt: 4 </span>

### <p style="text-align: center">Übung - Einführung in Datenbanksysteme (DBS I)<br>Sommersemester 2024</p>

# <p style="text-align:center">Aufgabenblatt 4:<br> Structured Query Language (SQL) und Domänenkalkül</p>
### <p style="text-align:center">Abgabetermin: 19.06.2024</p>

**Für die Bewertung der Aufgaben ist es erforderlich, dass Sie sich im Moodle-System für die Veranstaltung eingetragen haben und einer Gruppe zugeordnet sind. Zur Erinnerung: Sie müssen die Übungsaufgaben entweder für die Medium oder Large Kursvariante absolvieren. Unter folgendem Link finden Sie den [Entscheidungsbaum](https://moodle.hu-berlin.de/pluginfile.php/6078038/mod_forum/attachment/1722236/DBS_decision_tree.pdf}{Entscheidungsbaum), der Ihnen bei der Ermittlung Ihrer vorgesehenen Kursvariante helfen soll.
Die Teilaufgaben, die mit einem (\*) versehen sind, müssen von Studierenden aus den *Medium* Gruppen NICHT bearbeitet werden. Geben Sie Ihre Lösung zu den Aufgaben 1, 2 und 3 als Jupyter Notebook mittels Moodle ab. Die Abgaben benennen Sie bitte jeweils wie folgt: "A1.2-Musterfrau-Beispiel-Sonne.pdf" für Aufgabenblatt 1 Aufgabe 2 von Lisa Musterfrau, Mark Beispiel und Sonja Sonne.<br><br>
Die maximale Punktzahl beträgt für Medium: 34, Large: 60 Punkte.** 
<br> <br>

### Hinweise 
In diesem Aufgabenblatt geht es um Anfragen in SQL, das Erstellen von Tabellen, die bestimmten Integritätsbedingungen genügen, und Anfragen des Domänenkalküls. <br>
Die SQL-Anfragen werden an die Datenbank "Terra" gerichtet. <br>
Jede Teilaufgabe der Aufgaben 1 und 2 soll durch eine einzelne Anfrage gelöst werden. Die Teilaufgaben, die mit einem (\*) versehen sind, müssen von den Medium Studierenden NICHT bearbeitet werden. <br>
**Hinweis:** Die Anfragen werden an die Übungsdatenbank "Terra" gerichtet, die auf der Welt von 1988 basiert. Diese Übungsdatenbank wurde uns freundlicherweise vom Institut für Programmstrukturen und Datenorganisation der Universität Karlsruhe für Ausbildungszwecke überlassen. <br><br>
<span style="font-size:0.8em;">
\[*This exercise sheet deals with queries in SQL, the creation of tables that meet certain integrity conditions and queries of the domain calculus. The SQL queries are directed to the “Terra” database. Each subtask of tasks 1 and 2 is to be solved by a single query. The subtasks marked with an (\*) do NOT have to be solved by the Medium students. <br>
Note: The queries are directed to the exercise database “Terra”, which is based on the world of 1988. This exercise database was kindly provided to us by the Institute for Program Structures and Data Organization at the University of Karlsruhe for educational purposes.*\]</span>
<br><br><br>
**Benutzung der Datenbank:**<br>
1. Führen Sie den Block 1 -Initialisierung- aus und machen Sie sich mit den Hinweisen/Beispielen in den Blöcken 2) - 4) vertraut.
Sollte sich die Datenbank nicht im gleichen Ordner befinden wie dieses Jupyter Notebook, ändern Sie *pathToBase* entsprechend.
<br>
2. Vervollständigen und führen Sie den der entsprechenden Aufgabe zugehörigen Block aus.
<br>

<span style="font-size:0.8em;">*\[Using the database:<br>
1 Execute block 1) -Initialization- and familiarize yourself with the instructions/examples in blocks 2) - 4).
If the database is not in the same folder as this Jupyter notebook, change *pathToBase* accordingly.
<br>
2 Complete and execute the block associated with the corresponding task.\]*
</span>

### 1) Initialisierung

In [14]:
import sqlite3

pathToBase = "terraBase.db"
conn = sqlite3.connect(pathToBase)
cur = conn.cursor()


def executeQueryAndPrintResults(query):
    cur.execute(query)
    results = cur.fetchall()
    print(f"--> {len(results)} rows")
    for res in results:
        print(res)
    return

### 2) Ausgabe der Namen aller Relationen
Folgende Query gibt als Resultat die Namen aller Tabellen der Datenbank aus:
<br>
<span style="font-size:0.8em;">\[*The following query returns the names of all tables in the database:*\]</span>

In [4]:
query = "SELECT name FROM sqlite_master WHERE type='table';"
executeQueryAndPrintResults(query)

--> 25 rows
('berg',)
('ebene',)
('fluss',)
('geht_ueber_in',)
('geo_berg',)
('geo_ebene',)
('geo_fluss',)
('geo_insel',)
('geo_meer',)
('geo_see',)
('geo_wueste',)
('hat_sitz_in',)
('insel',)
('ist_benachbart_zu',)
('ist_mitglied_von',)
('kontinent',)
('land',)
('landteil',)
('liegt_an',)
('meer',)
('organisation',)
('see',)
('stadt',)
('umfasst',)
('wueste',)

### 3) Ausgabe der Attribute einer Relation
Folgendes Codesnippet gibt die Namen aller Attribute der Tabelle 'Land' an.
<br>
<span style="font-size:0.8em;">\[*The following code snippet specifies the names of all attributes of the 'Land' table.*\]</span>

In [12]:
cursor = cur.execute("SELECT * from Land")
names = list(map(lambda x: x[0], cursor.description))
print(names)

['l_id', 'l_name', 'einwohner', 'flaeche', 'hauptstadt', 'lt_id']

### 4) Beispiel für Query
Die Query gibt alle Städtenamen von Städten in Deutschland aus:<br>
<span style="font-size:0.8em;">\[*Example: The query returns all city names of cities in Germany:*\]</span>

In [5]:
query = "SELECT st_name FROM stadt WHERE l_id ='D';"
executeQueryAndPrintResults(query)

--> 114 rows
('Aachen',)
('Aschaffenburg',)
('Augsburg',)
('Bad_Hersfeld',)
('Bad_Toelz',)
('Bautzen',)
('Berlin',)
('Bernburg',)
('Bochum',)
('Bonn',)
('Brandenburg',)
('Bremen',)
('Bremerhafen',)
('Celle',)
('Chemnitz',)
('Cottbus',)
('Deggendorf',)
('Dessau',)
('Dillingen',)
('Donauwoerth',)
('Dortmund',)
('Dresden',)
('Duesseldorf',)
('Duisburg',)
('Eilenburg',)
('Emden',)
('Emsdetten',)
('Erfurt',)
('Essen',)
('Flensburg',)
('Forst',)
('Frankfurt/M',)
('Frankfurt/O',)
('Friedrichshafen',)
('Fuerstenwalde',)
('Fuessen',)
('Fulda',)
('Goerlitz',)
('Goettingen',)
('Grimma',)
('Halle',)
('Hamburg',)
('Hameln',)
('Hannover',)
('Heilbronn',)
('Hoexter',)
('Ingolstadt',)
('Jena',)
('Karlsruhe',)
('Kassel',)
('Kempten',)
('Kiel',)
('Koblenz',)
('Koeln',)
('Konstanz',)
('Konz',)
('Landsberg',)
('Landshut',)
('Leipzig',)
('Leverkusen',)
('Lindau',)
('Lingen',)
('Ludwigshafen',)
('Lutherstadt_Wittenberg',)
('Magdeburg',)
('Mainz',)
('Mannheim',)
('Meiningen',)
('Meissen',)
('Meppen',)
('Merseburg',)
('Minden',)
('Muehldorf',)
('Muenchen',)
('Muenster',)
('Neubrandenburg',)
('Neuburg',)
('Nienburg',)
('Nuernberg',)
('Passau',)
('Potsdam',)
('Radebeul',)
('Rathenow',)
('Regensburg',)
('Rheine',)
('Riedlingen',)
('Riesa',)
('Rosenheim',)
('Rostock',)
('Saarbruecken',)
('Saarlouis',)
('Schwedt',)
('Schweinfurt',)
('Schwerin',)
('Sigmaringen',)
('Starnberg',)
('Stralsund',)
('Straubing',)
('Stuttgart',)
('Torgau',)
('Trier',)
('Tuebingen',)
('Ulm',)
('Voelklingen',)
('Waldshut_Tiengen',)
('Waren',)
('Warendorf',)
('Weisenfels',)
('Wiesbaden',)
('Wilhelmshaven',)
('Worms',)
('Wuerzburg',)
('Wurzen',)
('Zittau',)

## Aufgabe 1: Anfragen an "Terra" <span style="float:right"> (Medium: 20, Large: 34 Punkte)</span>
Vervollständigen Sie für jede Teilaufgabe die Query und führen Sie den entsprechenden Block aus. <br>

Im Moodle-Kurs finden Sie ein vereinfachtes (unvollständiges) ER-Modell. Im Allgemeinen können Sie davon ausgehen, dass `l_id` für die Relation `land`, `(lt_id, l_id)` für `landteil`, `abkuerzung` für Organisation, `(st_name, lt_id, l_id)` für `stadt`, und das entsprechende Name-Attribut in `see`, `meer`, `insel`, usw. als Schlüssel dienen (und somit als Fremdschlüssel in anderen Relationen benutzt werden).
<br>
<span style="font-size:0.8em;">\[*In each subtask, complete the query and execute the block. In the Moodle course you will find a simplified (incomplete) ER model. In general, you can assume that the following attribute(s) serve as a key for the respective relation, and are correspondingly used as foreign keys in other relations: l_id for land, (lt_id, l_id) for landteil, abkuerzung for organisation, (st_name, lt_id, l_id) for stadt, and the respective name attribute in see, meer, insel, etc.*\]</span>

1.1) Geben Sie den Namen und die Koordinaten (Länge und Breite) aller Städte in Brasilien ('BR') an, die oberhalb des Äquators (breite >= 0) liegen. **(1 Punkt)**
<br>
<span style="font-size:0.8em;">\[*Output the name and coordinates (laenge and breite) of all cities in Brazil ('BR') that lie above the equator (breite >= 0).*\]</span>

In [6]:
query = "SELECT st_name, laenge, breite FROM stadt WHERE l_id='BR' AND breite>=0 "
executeQueryAndPrintResults(query)

--> 2 rows
('Boa_Vista', -604.0, 25.0)
('Macapa', -520.0, 0.5)

1.2) Ermitteln Sie von jedem Landesteil in den USA ('USA') die Städte, die darin liegen. Geben Sie die Namen der Städte zusammen mit dem Namen des jeweiligen Landesteils aus. <b> (1 Punkt)</b>
<br>
<span style="font-size:0.8em;">\[*For each region (landteil) of the USA ('USA'), determine the cities that are located within that region. Return the names of the cities together with the name of the respective region (landteil).*\]</span>

In [11]:
query = "SELECT st_name, lt_id FROM stadt WHERE l_id='USA'"
executeQueryAndPrintResults(query)

--> 68 rows
('Albany', 'NY')
('Annapolis', 'MD')
('Atlanta', 'GA')
('Augusta', 'ME')
('Austin', 'TX')
('Baltimore', 'MD')
('Baton_Rouge', 'LA')
('Bismarck', 'ND')
('Boise', 'ID')
('Boston', 'MA')
('Carson_City', 'NV')
('Charleston', 'WV')
('Cheyenne', 'WY')
('Chicago', 'IL')
('Columbia', 'SC')
('Columbus', 'OH')
('Concord', 'NH')
('Dallas', 'TX')
('Denver', 'CO')
('Des_Moines', 'IA')
('Detroit', 'MI')
('Dover', 'DE')
('Fort_Worth', 'TX')
('Frankfort', 'KY')
('Harrisburg', 'PA')
('Hartford', 'CT')
('Helena', 'MT')
('Hendersonville', 'NC')
('Honolulu', 'HI')
('Indianapolis', 'IN')
('Jackson', 'MS')
('Jefferson_City', 'MO')
('Juneau', 'AK')
('Kansas_City', 'MO')
('Lansing', 'MI')
('Las_Vegas', 'NV')
('Lincoln', 'NE')
('Little_Rock', 'AR')
('Los_Angeles', 'CA')
('Madison', 'WI')
('Miami', 'FL')
('Montgomery', 'AL')
('Montpelier', 'VT')
('Nashville', 'TN')
('New_York', 'NY')
('Oklahoma_City', 'OK')
('Olympia', 'WA')
('Phoenix', 'AZ')
('Pierre', 'SD')
('Providence', 'RI')
('Raleigh', 'NC')
('Rapid_City', 'SD')
('Richmond', 'VA')
('Sacramento', 'CA')
('Salem', 'OR')
('Salt_Lake_City', 'UT')
('Santa_Fe', 'NM')
('San_Antonio', 'TX')
('San_Diego', 'CA')
('San_Francisco', 'CA')
('Springfield', 'IL')
('St._Louis', 'MO')
('St._Paul', 'MN')
('Tallahassee', 'FL')
('Topeka', 'KS')
('Trenton', 'NJ')
('Washington', 'DC')
('Williamsburg', 'VA')

1.3) Bestimmen Sie die Landfläche der Erde. **Hinweis**: Benutzen Sie dafür die Tabelle kontinent. <b> (1 Punkt) </b>
<br>
<span style="font-size:0.8em;">\[*Determine the land area of the earth. Note: Use the table kontinent for that.*\]</span>

In [8]:
query = "SELECT k_name FROM Kontinent"
executeQueryAndPrintResults(query)

--> 5 rows
('Afrika',)
('Amerika',)
('Asien',)
('Australien',)
('Europa',)

1.4) Geben Sie die Gesamtzahl aller Gewässer (Flüsse, Seen, Meere) aus. <b> (2 Punkte)</b> 
<br>
<span style="font-size:0.8em;">\[*Determine the total number of all bodies of water (rivers, lakes, seas).*\]</span>

In [9]:
query = "SELECT (SELECT COUNT(*) FROM Fluss) +(SELECT COUNT(*) FROM See) +(SELECT COUNT(*) FROM Meer) AS Gesamtzahl_Gewaesser;"
executeQueryAndPrintResults(query)

--> 1 rows
(259,)

1.5) Ermitteln Sie die IDs der Länder, die in mehr als 10 Organisationen Mitglied sind. **Hinweis:** Benutzen Sie nur die Tabelle ist_mitglied_von. <b> (2 Punkte)</b> 
<br>
<span style="font-size:0.8em;">\[*Determine the IDs of the countries that are members of more than 10 organizations. Note: Only use the table ist_mitglied_von.*\]</span>

In [12]:
query = "SELECT l_id FROM ist_mitglied_von GROUP BY l_id HAVING COUNT(*) > 10"
executeQueryAndPrintResults(query)

--> 5 rows
('AS',)
('D',)
('F',)
('J',)
('NZ',)

1.6) Bestimmen Sie den Namen und die Tiefe der Golfe, die mindestens so tief sind wie die durchschnittliche Berghöhe. Ein Golf soll in dem Fall ein Meer sein, das "Golf" im Namen beinhaltet. <b> (2 Punkte) </b> 
<br>
<span style="font-size:0.8em;">\[*Determine the name and depth of the gulfs that are at least as deep as the average mountain height. In this case, a gulf should be a sea that contains “Golf” in its name.*\]</span>

In [ ]:
query = ""
executeQueryAndPrintResults(query)

1.7) Bestimmen Sie die Namen der Länder in Afrika, die zu keinem anderen Land benachbart sind. **Hinweis**: Benutzen Sie dafür die Tabellen umfasst, land und ist_benachbart_zu, und beachten Sie, dass ist_benachbart_zu nicht bi-direktional ist. <b> (3 Punkte) </b> 
<br>
<span style="font-size:0.8em;">\[*Determine the names of the countries in Africa that do not have any neighboring countries. Note: Use the tables umfasst, land and ist_benachbart_zu, and note that ist_benachbart_zu is not bi-directional.*\]</span>

In [ ]:
query = ""
executeQueryAndPrintResults(query)

1.8) Ein Land, in dem mehr als 10 Prozent der Bevölkerung in Großstädten lebt, soll als stark urbanisiert gelten. Als Großstädte werden Städte mit mehr als 500000 EinwohnerInnen betrachtet. Welche  Länder, deren Landanteil zu 100 Prozent in Asien liegt, gelten demzufolge als stark urbanisiert? Geben Sie die jeweiligen Ländernamen aus. (Eine einzige Anfrage!) <b> (4 Punkte) </b>
<br>
<span style="font-size:0.8em;">\[*A country in which more than 10 percent of the population lives in large cities is considered to be highly urbanized. Cities with more than 500,000 inhabitants are considered large cities. Which countries with 100 percent of their land in Asia are therefore considered to be highly urbanized? Output the names of the countries. (One single query!)*\]</span>

In [ ]:
query = ""
executeQueryAndPrintResults(query)

1.9) Ermitteln Sie alle Paare von Inseln, die zur gleichen Inselgruppe aber zu unterschiedlichen Ländern gehören. Geben Sie die Namen der Inseln, den Namen der Inselgruppe, sowie die zugehörigen Ländernamen aus. Geben Sie jedes Paar von Inseln nur einmal aus. Schließen Sie außerdem Inseln aus, die einen leeren Eintrag (`NULL` oder einen leeren String `''`) in Inselgruppe haben. <b>  (4 Punkte)</b>
<br>
<span style="font-size:0.8em;">\[*Determine all pairs of islands that belong to the same island group (inselgruppe) but to different countries. Determine the names of the islands, the name of the island group and the corresponding country names. Return each pair of islands only once. Also exclude islands that have an empty entry (NULL or an empty string '') in inselgruppe.*\]</span>

In [ ]:
query = ""
executeQueryAndPrintResults(query)

1.10)(*) Ermitteln Sie alle Länder, die mindestens einen Berg, eine Ebene, oder eine Wüste haben. Geben Sie die ID und die Namen der entsprechenden Länder aus. **Hinweis:** Für diese Aufgabe sollen Sie ausnahmsweise berücksichtigen, dass manche Länder-IDs in den "geo_"-Tabellen keinen entsprechenden Eintrag in der Tabelle land haben. Geben Sie in dem Fall die l_id dennoch aus, wobei der Name des Landes dann `NULL` sein soll. <b> (3 Punkte) </b> 
<br>
<span style="font-size:0.8em;">\[*Determine all countries that have at least one mountain (berg), one plain (ebene) or one desert (wueste). Return the ID and the names of the corresponding countries. Note: For this task, you should take into account that some country IDs (l_id) in the “geo_” tables do not have a corresponding entry in the table land. In this case, output the l_id anyway, whereby the name of the country should then be NULL.*\]</span>

In [ ]:
query = ""
executeQueryAndPrintResults(query)

1.11) (*) Geben Sie den Namen der Organisation aus, deren Mitgliedsländer in Summe die wenigsten Einwohner haben, zusammen mit der Summe der Einwohner der Mitgliedsländer. **Hinweis**: Mit "LIMIT 1" können Sie die Ausgabe auf ein Tupel begrenzen.
<b> (3 Punkte) </b> 
<br>
<span style="font-size:0.8em;">\[*Enter the name of the organization whose member countries have the fewest inhabitants in total, along with the sum of the inhabitants of the member countries.*\]</span>

In [ ]:
query = ""
executeQueryAndPrintResults(query)

1.12) (*) Geben Sie die Länge des gesamten amerikanischen Flusssystems aus. <b> (4 Punkte) </b> 
<br>
<span style="font-size:0.8em;">\[*Determine the length of the entire American river system.*\]</span>

In [ ]:
query = ""
executeQueryAndPrintResults(query)

1.13) (*) Ermitteln Sie für jedes Land (in dem mindestens ein Berg liegt) die Berge, die höher als die durchschnittliche Berghöhe in dem entsprechenden Land sind. Geben Sie den Namen sowie die Höhe der entsprechenden Berge jeweils zusammen mit dem Namen des Landes, in dem sie liegen, aus. **Hinweis**: Manche Berge liegen in mehreren Landesteilen eines Landes und sollen dementsprechend nicht mehrmals berücksichtigt werden. <b> (4 Punkte) </b> 
<br>
<span style="font-size:0.8em;">\[*For each country (which has at least one mountain), determine the mountains that are higher than the average mountain height in the respective country. Return the name and the height of the corresponding mountains together with the name of the country in which they are located. Note: Some mountains are located in several parts of a country and should therefore not be included more than once.*\]</span>

In [ ]:
query = ""
executeQueryAndPrintResults(query)

## Aufgabe 2: Integritätsbedingungen<span style="float:right"> (Medium: 14, Large: 18 Punkte)</span>

Gegeben sei ein (vereinfachtes) Datenbankschema mit folgenden Tabellen:
<br>
<span style="font-size:0.8em;">\[*Given a (simplified) database schema with the following tables:*\]</span>

* **Fan** (name VARCHAR(100), address VARCHAR(255), status VARCHAR(25))

* **Concert** (c_id INTEGER, band VARCHAR(100), venue VARCHAR(100), city VARCHAR(100), c_date DATE)

* **Ticket** (concert_id INTEGER, fan_id VARCHAR(100), purchase_time DATETIME, quantity INTEGER)

Dabei sei anzunehmen, dass `c_date` als 'YYYY-MM-DD' und `purchase_time` als 'YYYY-MM-DD HH:MM:SS' dargestellt werden. Die Funktionen `date('now')` bzw. `datetime('now')` können z.B. verwendet werden, um einen entsprechenden Zeitstempel zu erzeugen.
<br>
<span style="font-size:0.8em;">\[*We assume that c_date is represented in 'YYYY-MM-DD' format and purchase_time in 'YYYY-MM-DD HH:MM:SS' format. The functions date('now') or datetime('now'), respectively, may be used to generate corresponding timestamps.*\]</span>

In [10]:
pathToBase = "dummy.db"
conn = sqlite3.connect(pathToBase)
cur = conn.cursor()
executeQueryAndPrintResults("PRAGMA foreign_keys = ON;")

--> 0 rows

1.) Erstellen Sie die Tabelle `Fan`. Deklarieren Sie dabei `name` als Primärschlüssel, sowie die übrigen Attribute als `NOT NULL`. 
Deklarieren Sie `'Basic'` als Default-Wert für Status.  **(2.5 Punkte)**
<br>
<span style="font-size:0.8em;">\[*Create the table Fan. Declare name as the primary key and the other attributes as NOT NULL. Declare 'Basic' as the default value for status.*\]</span>

In [16]:
query = "CREATE TABLE Fan(name VARCHAR(100) PRIMARY KEY ,adress VARCHAR(255) NOT NULL , status VARCHAR(25) NOT NULL DEFAULT 'Basic')"
executeQueryAndPrintResults(query)

OperationalError: table Fan already exists

2.) Fügen Sie ein Tupel in die Tabelle `Fan` ein. **(0.5 Punkte)**
<br>
<span style="font-size:0.8em;">\[*Insert a tuple into the table fan.*\]</span>

In [17]:
query = "INSERT INTO Fan (name, adress) VALUES ('Basel' , 'Maghar Village')"
executeQueryAndPrintResults(query)

--> 0 rows

3.) Erstellen Sie die Tabelle `Concert`. Deklarieren Sie dabei `c_id` als Primärschlüssel und die übrigen Attribute als `NOT NULL`. Außerdem sollen `band` und `c_time` zusammen als weiterer Schlüsselkandidat deklariert werden, d.h. die Kombination aus `band` und `c_time` soll einzigartig sein. **(2.5 Punkte)**
<br>
<span style="font-size:0.8em;">\[*Create the table Concert. Declare c_id as the primary key and the other attributes as NOT NULL. In addition, band and c_time should be declared together as an additional key candidate, i.e. the combination of band and c_time should be unique.*\]</span>

In [18]:
query = "CREATE TABLE Concert(c_id INTEGER PRIMARY KEY, band VARCHAR(100) NOT NULL, venue VARCHAR(100) NOT NULL, city VARCHAR(100) NOT NULL, c_date DATE NOT NULL, UNIQUE(band, c_date))"
executeQueryAndPrintResults(query)

--> 0 rows

4.) Fügen Sie ein Tupel in die Tabelle `Concert` ein. **(0.5 Punkte)**
<br>
<span style="font-size:0.8em;">\[*Insert a tuple into the table Concert.*\]</span>

In [30]:
query = "INSERT INTO Concert VALUES (1, 'AC/DC', 'Fridrischstrasse', 'Berlin', '2024-06-16') "
executeQueryAndPrintResults(query)

--> 0 rows

5.) Erstellen Sie die Tabelle `Ticket`. Stellen Sie mittels Fremdschlüsseln sicher, dass es zu jedem Ticket ein Tupel in der `Fan` Relation sowie ein Tupel in der `Concert` Relation gibt. Deklarieren Sie `concert_id`, `fan_id` und `purchase_time` zusammen als Primärschlüssel. Die restlichen Attribute sollen `NOT NULL` sein. Stellen Sie außerdem sicher, dass die Anzahl (`quantity`) der Tickets pro Kauf zwischen 1 und 10 liegt. <b>(3 Punkte)</b>
<br>
<span style="font-size:0.8em;">\[*Create the Ticket table. Use foreign keys to ensure that there is a tuple in the Fan relation and a concert in the Concert relation for each ticket. Declare concert_id, fan_id and purchase_time together as the primary key. The remaining attributes should be NOT NULL. Also make sure that the quantity of tickets per purchase is between 1 and 10.*\]</span>

In [19]:
query = "CREATE TABLE Ticket(concert_id INTEGER, fan_id VARCHAR(100), purchase_time DATETIME, quantity INTEGER NOT NULL, PRIMARY KEY(concert_id,fan_id,purchase_time), CHECK(quantity >=1 AND quantity <= 10), FOREIGN KEY(fan_id) REFERENCES Fan(name), FOREIGN KEY(concert_id) REFERENCES Concert(c_id) ) "
executeQueryAndPrintResults(query)

--> 0 rows

6.) Der Fan 'Benny Chaos' hat Hausverbot bei der Band 'The Relational Rebels'. Erstellen Sie einen Trigger, der sicherstellt, dass Benny Chaos keine Tickets dieser Band kaufen kann. <b>(4 Punkte)</b>
<br>
<span style="font-size:0.8em;">\[*The fan 'Benny Chaos' is banned from concerts of the band 'The Relational Rebels'. Create a trigger that ensures that Benny Chaos cannot buy tickets for this band.*\]</span>

In [20]:
query = "CREATE TRIGGER banned_from_buying BEFORE INSERT ON Ticket FOR EACH ROW WHEN NEW.fan_name = 'Benny Chaos' AND NEW.concert_id IN (SELECT c_id FROM Concert WHERE band = 'The Relational Rebels') BEGIN SELECT RAISE(ABORT, ‘Not allowed to buy a Ticket’); END;"
executeQueryAndPrintResults(query)

OperationalError: near "allowed": syntax error

7.)(*) Erzeugen Sie einen Trigger, der den Status eines Fans nach dem Kauf von Tickets auf `'Premium'` setzt, wenn dieser damit ingesamt mehr als 20 Tickets gekauft hat. <b>(4 Punkte)</b>
<br>
<span style="font-size:0.8em;">\[*Create a trigger that sets the status of a fan to 'Premium' after the purchase of tickets if they have bought more than 20 tickets in total at that point.*\]</span>

In [ ]:
query = ""
executeQueryAndPrintResults(query)

8.) Löschen Sie alle von Ihnen erzeugten Objekte.  <b>(1 Punkt)</b>
<br>
<span style="font-size:0.8em;">\[*Delete all the objects you have created.*\]</span>

In [ ]:
query = ""
executeQueryAndPrintResults(query)

## Aufgabe 3: Domänenkalkül<span style="float:right"> (Medium: -, MA: 8 Punkte)</span>
Gegeben seien folgende Relationen:
<br>
<span style="font-size:0.8em;">\[*The following relations are given:*\]</span>
<br><br>
<b>Kunde</b> (Name, Stadt, Konto) <br>
<b>Angebot</b> (Warenbezeichnung, Lieferant, Preis) <br>
<b>Bestellung</b> (Name, Warenbezeichnung, Bestellmenge, Lieferant) <br><br>
Ferner sei eine Domänenkalkülanfrage unter Verwendung der Prädikatensymbole Kunde, Angebot und Bestellung gegeben. Die Symbole entsprechen dabei den gleichnamigen Relationen.
<br>
<span style="font-size:0.8em;">\[*Furthermore, a domain calculus query is given using the predicate symbols Kunde, Angebot and Bestellung. The symbols correspond to the relations of the same name.*\]</span>
<br><br>
F = {Name, Stadt | <br>
∃ Konto, Warenbezeichnung, Lieferant, Preis, Bestellmenge (Kunde(Name, Stadt, Konto) <br>
∧ Angebot(Warenbezeichnung, Lieferant, Preis) <br>
∧ Bestellung(Name, Warenbezeichnung, Bestellmenge, Lieferant) <br>
∧ Preis ≥ 200 ∧ Lieferant = ’Müller’)} <br>
______
1.) Beschreiben Sie in einem Satz das Ergebnis dieser Anfrage. <b> (1 Punkte)</b>
<br>
<span style="font-size:0.8em;">\[*Describe the result of this query in one sentence.*\]</span>

Antwort:

2.) Bestimmen Sie für die Well-Formed-Formula (WFF) der Anfrage die Menge der freien und gebundenen Variablen. <b> (2 Punkte) </b>
<br>
<span style="font-size:0.8em;">\[*Determine the set of free and bound variables for the well-formed formula (WFF) of the query.*\]</span>

Antwort:

3.) (*) Ist die WFF der Anfrage sicher? Begründen Sie Ihre Antwort anhand der Definition der Sicherheit.<b> (3 Punkte) </b>
<br>
<span style="font-size:0.8em;">\[*Is the WFF of the request safe? Justify your answer based on the definition of safeness.*\]</span>

Antwort:

4.) Geben Sie einen zu der Anfrage äquivalenten Ausdruck in relationaler Algebra an. <b> (2 Punkte) </b>
<br>
<span style="font-size:0.8em;">\[*Give an expression equivalent to the query in relational algebra.*\]</span>

Antwort: